package lv.javaguru.homework;
/*
Написать консольную программу, которая при помощи цикла for печатает на консоли числа от 0 до 100.
 */

public class Print100NumbersFor {
    public static void main (String[] args){
        for (int i = 1; i < 101; i++){
            System.out.println(i);
        }
    }
}
